app/controllers/campaigns_controller.rb

    def show
        @campaign = Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @campaign = Campaign.new(campaign_paramas)

        if @campaign.save
---
INSERT INTO "campaigns" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2021-08-23 16:09:16.546528"], ["updated_at", "2021-08-23 16:09:16.546528"]]

    def update
        @campaign = Campaign.find(params[:id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]