app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @character = Character.find(params[:id])

INSERT INTO "characters" ("name", "owner", "race", "role", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Ren"], ["owner", "Andrew"], ["race", "Dwarf"], ["role", "rogue"], ["level", 1], ["created_at", "2021-08-11 17:40:06.048414"], ["updated_at", "2021-08-11 17:40:06.048414"]]
---
    def create
        @character = Character.new(character_params)
        # binding.pry
        if @character.save

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @character = Character.find(params[:id])

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "characters" SET "role" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["role", "ranger"], ["updated_at", "2021-08-16 15:26:38.713731"], ["id", 2]]
---
    def update
        @character = Character.find(params[:id])

        if @character.update(character_params)

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 2]]
---
    def destroy
        @characters = Character.find(params[:id])
        @characters.destroy