app/controllers/dm_controller.rb

    def index
        @dms = Dm.all
        @players = Player.all
        @characters = Character.all
        @campaigns = Campaign.all
        @weapons = Weapon.all
---
SELECT "players".* FROM "players"
SELECT "characters".* FROM "characters"
SELECT "campaigns".* FROM "campaigns"
SELECT "weapons".* FROM "weapons"