app/controllers/players_controller.rb

    def create
        @player = Player.new(player_params)

        if @player.save
---
INSERT INTO "players" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Greg juice"], ["created_at", "2021-08-11 16:42:07.019310"], ["updated_at", "2021-08-11 16:42:07.019310"]]

    def edit
        @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @player = Player.find(params[:id])

        if @player.update(player_params)
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "players" SET "name" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["name", "Greg"], ["updated_at", "2021-08-11 13:47:10.563082"], ["id", 10]]

    def destroy
        @player = Player.find(params[:id])
        @player.destroy
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 8]]