app/controllers/weapons_controller.rb

SELECT "weapons".* FROM "weapons"
---
    def index
        @weapons = Weapon.all

INSERT INTO "weapons" ("name", "weapon_types", "range", "damage", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "longsword"], ["weapon_types", "sword"], ["range", "5 ft"], ["damage", "1 d 10 "], ["created_at", "2021-08-25 17:40:31.624276"], ["updated_at", "2021-08-25 17:40:31.624276"]]
---
    def create

        @weapon = Weapon.new(weapon_params)

        if @weapon.save